/* 
   Localizable.strings
   Theseus

   Created by Jason Fieldman on 12/23/08.
 */


/* --------- Game Screen labels --------- */

"WaitLabel" = "WAIT";
"UndoLabel" = "UNDO";
"MenuLabel" = "MENU";
"ResetLabel" = "RESET";
"HintLabel" = "HINT";
"OptionsLabel" = "OPTIONS";

"LevelLabel" = "Level";
"DiamondLabel" = "Diamond";
"MovesLabel" = "Moves";
"BestLabel" = "Best";

/* --------- Main Menu labels --------- */

"TitleText" = "Theseus and the Minotaur";
"LevelSelection" = "Level Selection";
"DesignedBy" = "Designed by";

"NotYet" = "Not yet solved";
"MovesLevelSel" = "moves";
"SolvedIn" = "Solved in";

/* ---------- Game Completion Menu --------- */

"CompMenuLabel" = "MAIN MENU";
"CompNextLabel" = "NEXT LEVEL";
"CompReplayLabel" = "REPLAY";
"CompTitle" = "LEVEL COMPLETE!";
"CompSubtitle" = "moves";

/* ---------- Options ------------ */

"OptTitleSound" = "Sound";
"OptTitleIdle" = "Idle Timer";
"OptTitleHint" = "Hint Protection";
"OptTitleHand" = "Right-Handed";

"OptDescSound" = "This toggles all in-game sounds ON or OFF.";
"OptDescIdle" = "Turning this ON allows the iPhone to sleep if you stare at a puzzle for too long.";
"OptDescHint" = "Turning this ON disables the hint button to prevent you from accidentally pressing it :)";
"OptDescHand" = "Turning this ON reorganizes the controls for better use when held with the right hand.";

/* ---------- Tutorial ---------------- */

"TutorialTitle" = "Tutorial";

"Tutorial0" = "Welcome to Theseus and the Minotaur!  Don't Panic: This is an introductory level and you can't die here :)

Let's get our bearings.  Take a look at the level map above this text.  You are Theseus: prince of Greece and the fashionable blue circle.  You have been thrust into the labyrinth of the Minotaur: the angry red circle that wants to devour you.

To escape from a level, you must reach the exit stairway without the Minotaur catching you (when he catches you, you're lunch).  But don't be too afraid to experiment; you can undo a move at any time by pressing the \"Undo\" button, or you can reset the entire level by pressing the \"Reset\" button.  You can also head back to the main menu by pressing the \"Menu\" button.

At this point, you may have noticed that the Minotaur is trapped in a compartment in the central row of the level.  Since you can move freely without fear of capture, let's go over the many ways you can move Theseus about the maze:

1. Use the direction pad at the bottom-center of the screen.  Tap a direction and you will move one tile space.

2. Single-tap anywhere on the maze with one finger.  You will move one tile space closer to where you tapped (if possible).

3. Drag one finger around the maze.  You will move tile-by-tile in the direction that you are dragging.

Two additional gestures are supported:  You can tap once with two fingers to replicate the \"Wait\" function, and you can execute \"Undo\" by swiping two fingers to the left.

Use whichever navigation method you like to reach the stairs in the upper-right.  On the way, watch how the Minotaur moves.  We'll discuss him more during the next level.
";

"Tutorial1" = "Now for your first real challenge.  You'll notice that the Minotaur is loose in this level, and can reach you if you're not careful.

To survive, it is critical to understand how the Minotaur operates:

1. The Minotaur will always wait for you to move first (so you can take as much time as you want to think about your next move).

2. For every move that you make, the Minotaur is allowed to make up to two moves.

3. For each of the Minotaur's two moves, he will only move closer to you.  He will never move into a tile that is further from you than he already is.  If he is not able to move closer to you, he will stay still and forfeit the rest of his turn.  Remember that the Minotaur cannot move through walls.

4. For each of the Minotaur's two moves, he may have a choice to move either horizontally or vertically.  Given this choice, he will always move horizontally.

Before we turn this knowledge into practice, let's get death out of the way.  Death is scary in most games, but not in this one.  This game is about solving the level through experimentation and pattern matching, and being afraid to die will seriously hinder that.  So make Theseus take a step to the right!  When you do so, the Minotaur will get his two moves.  He will step once to the right and once downwards; both moves draw him closer to you.  Now take a step to the left to run away!  Unfortunately, the Minotaur can take two steps again: once down and once to the left where he will catch and eat you :(  But it's painless - simply press the undo button twice and we're back to the beginning!

Now that you've experienced death, let's solve this the correct way.  Take a step to left.  The Minotaur will take two steps closer to you: once to the left and once downwards.  But see what happens now when you take a step to the right: in his current position, the Minotaur has a choice to move horizontally or vertically closer to you, and he will always choose horizontally (he disregards the walls when making this decision).  So the Minotaur has walked right into a trap!  From this position he can only move left if you move left again.  Otherwise, moving left would be moving further from you (which he is not allowed to do).  You can now proceed right and upwards to exit the level!
";

"Tutorial2" = "You may have noticed that you were awarded medals when you completed the previous levels.  You will receive a gold or silver medal based on your performance.  Gold medals are awarded for beating a level in the fewest moves possible, otherwise you receive a silver medal.  If you look at the top-center of the screen, you will see the move counter.  The first number is the number of moves you have already made.  The second number is the maximum number of moves allowed to receive a gold medal.  You can replay levels as many times as you want to try to earn the gold medal.

If you want to try to beat this tutorial level on your own, go ahead and experiment!  If you die or make a mistake, you can always undo or reset.  Read below for the solution to this level.

From the starting position, walk right until you reach the right side of the maze.  The Minotaur cannot move, since moving up or down would take him further from you.  Now take one step up; the Minotaur can move upwards now (and then he will proceed to the right).  Take three steps down until you reach the lower-right of the maze.  Notice that the Minotaur keeps moving right (rather than moving down) since he always favors horizontal movement.  He only moves down once he reaches your column.  

From your current position in the lower-right of the maze, take one step to the left.  Since the Minotaur favors horizontal movement, his first step will also be to the left.  From there, his second step will be down (to get closer to you).  But what is this?  The Minotaur has trapped himself again!  He can't move upwards anymore, since that would be moving further from you.  You are now safe to proceed to the stairway.
";

"Tutorial3" = "This is the last tutorial level, so let's go over a few advanced concepts before we send you off on your own.

First, remember that the Minotaur always gets his two moves before you can escape down the stairs.  So those stairs to the right look really close, but if you try to make a dash for them, the Minotaur will catch you on his second move (try it!)

Second, this game employs Smart Undo.  This means that if you visit a position you have already been in, the game automatically adjusts your move counter as if you had used the undo command.  You can try this out from the starting position by moving down twice and then up twice.  On the way up, the move counter reduces since you have already been in those positions (a move position is based on the locations of both Theseus and the Minotaur).

Third, if you get really stuck you can use the hint button to allow the game to make one step for you.  If the game sees there is no way to win from your current position, it will undo once for you.  To use the hint button you must turn off hint protection from the options menu.  Please use it as a last resort, since it will ruin the puzzle for you!

Now, In order to escape from this level you will have to use the \"Wait\" command.  You can wait by pressing the wait button, or you can tap two fingers on the maze.  Let's see how waiting helps:

Take two steps down and then one to the left.  From this position, you will die if you take an immediate step back to the right.  Wouldn't it be nice if the Minotaur walked down into the trap on his own?  He will if you wait.  Waiting allows the Minotaur to take his two turns as if you had taken a step (except that you don't have to move tiles).  This is necessary to lead the Minotaur into certain trap squares - don't forget about it!

(Before we finish this level and send you off on your own, don't forget that you can go to the main menu and play any level in any order.  Levels generally get harder as the numbers increase, but we've thrown in some doosies near the beginning.  Level 10 is usually where most people first get stuck, so feel free to move on to level 11 and come back later to the ones you skipped.)

Now that you've waited and the Minotaur is in the little nook, head right twice, then up twice to the stairs.  You'll see that the Minotaur can't reach you before you escape!

Best of luck!  Don't forget to visit the forums if you want to discuss the game with others: http://theseus.fieldman.org/forum
";

/* --------- Info Text ----------- */

"InfoText" = "Theseus and the Minotaur (v2.1.3)
iPhone version created by Jason Fieldman

If you are new to the game, you are encouraged to start with level 0.  Levels 0-3 contain tutorial text that will introduce you to the mechanics of the Theseus puzzle.

More information about the iPhone version, including discussion forums, is here:
http://theseus.fieldman.org

This game is based on the famous Theseus and the Minotaur puzzle designed by Robert Abbott.  More info about the history of this puzzle, along with Robert's other works, can be found here:
http://www.logicmazes.com/theseus

A Windows and Macintosh version of the game has been developed by Kristanix Games:
http://www.kristanix.com

Special thanks to Toby Nelson for significant work on level design:
http://www.tnelson.demon.co.uk
";



